1c/standalone/src/InformationRegisters/Кабиторий_ИсходящиеНамерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Кабиторий_ИсходящиеНамерения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.Кабиторий_ОказаниеУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭффекта</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_ВидыИсходящихЭффектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_СостоянияНамерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/standalone/src/Enums/Кабиторий_ВидыИсходящихЭффектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Кабиторий_ВидыИсходящихЭффектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коннектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеВовне</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/standalone/src/Enums/Кабиторий_ВидыДоменныхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Кабиторий_ВидыДоменныхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаСоздана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаПодана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаАкцептована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОплачена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаблокирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаРазблокирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатПодписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатВыдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусКлиентаИзменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/standalone/src/CommonModules/Кабиторий_ДоменныеСобытия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Публикует доменное событие (§19) и запускает реакции.
// Вызывается ВНУТРИ доменной транзакции операции-источника: внутренние реакции
// синхронны, внешние - через Outbox (намерение пишется в той же транзакции).
//
// Параметры:
//   ВидСобытия - EnumRef.Кабиторий_ВидыДоменныхСобытий - тип события
//   АгрегатСсылка - ДокументСсылка.Кабиторий_ОказаниеУслуги - агрегат-источник
//   Нагрузка - Структура - полезная нагрузка события (по умолчанию пустая)
//
// Возвращаемое значение:
//   Структура - опубликованное событие (контракт §19)
//
Функция Опубликовать(ВидСобытия, АгрегатСсылка, Нагрузка = Неопределено) Экспорт

	Событие = НовоеСобытие(ВидСобытия, АгрегатСсылка, Нагрузка);

	ВыполнитьВнутренниеРеакции(Событие);
	ЗапланироватьВнешниеРеакции(Событие);

	Возврат Событие;

КонецФункции

// Конструктор доменного события (контракт §19).
//
// Параметры:
//   ВидСобытия - EnumRef.Кабиторий_ВидыДоменныхСобытий - тип события
//   АгрегатСсылка - ДокументСсылка.Кабиторий_ОказаниеУслуги - агрегат-источник
//   Нагрузка - Структура - полезная нагрузка (по умолчанию пустая)
//
// Возвращаемое значение:
//   Структура - поля: ИдентификаторСобытия, ВидСобытия, ИдентификаторАгрегата,
//               ВозниклоВ, Версия, Нагрузка
//
Функция НовоеСобытие(ВидСобытия, АгрегатСсылка, Нагрузка = Неопределено) Экспорт

	ФактическаяНагрузка = Нагрузка;
	Если ФактическаяНагрузка = Неопределено Тогда
		ФактическаяНагрузка = Новый Структура;
	КонецЕсли;

	Событие = Новый Структура;
	Событие.Вставить("ИдентификаторСобытия", Строка(Новый УникальныйИдентификатор));
	Событие.Вставить("ВидСобытия", ВидСобытия);
	Событие.Вставить("ИдентификаторАгрегата", АгрегатСсылка);
	Событие.Вставить("ВозниклоВ", ТекущаяДатаСеанса());
	Событие.Вставить("Версия", 1);
	Событие.Вставить("Нагрузка", ФактическаяНагрузка);

	Возврат Событие;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет внутренние синхронные реакции на событие (§19) - в текущей транзакции.
// Точка расширения: сюда подключаются внутренние реакции (напр. пересбор индекса
// сегментов на СтатусКлиентаИзменён). Внешних вызовов здесь быть не должно (INV-10).
//
// Параметры:
//   Событие - Структура - доменное событие
//
Процедура ВыполнитьВнутренниеРеакции(Событие)

	// TODO: подключить внутренние реакции по мере появления (индекс сегментов §7 и т.п.).
	// Сейчас конкретных реакций нет - это точка расширения.
	Возврат;

КонецПроцедуры

// Планирует внешние реакции через Outbox (§19, INV-10): эффект исполнится вне
// транзакции. Ключ идемпотентности привязан к событию, чтобы повтор не дублировал.
//
// Параметры:
//   Событие - Структура - доменное событие
//
Процедура ЗапланироватьВнешниеРеакции(Событие)

	Если ТребуетсяУведомление(Событие.ВидСобытия) Тогда
		ВидЭффекта = Перечисления.Кабиторий_ВидыИсходящихЭффектов.Уведомление;
		Ключ = Событие.ИдентификаторСобытия + ":" + Строка(ВидЭффекта);
		РегистрыСведений.Кабиторий_ИсходящиеНамерения.ЗарегистрироватьНамерение(
			Событие.ИдентификаторАгрегата, ВидЭффекта, Событие, Ключ);
	КонецЕсли;

КонецПроцедуры

// Определяет, нужно ли уведомить клиента по событию (через DeliveryProvider/Outbox).
//
// Параметры:
//   ВидСобытия - EnumRef.Кабиторий_ВидыДоменныхСобытий
//
// Возвращаемое значение:
//   Булево - Истина, если событие порождает уведомление клиента
//
Функция ТребуетсяУведомление(ВидСобытия)

	Виды = Перечисления.Кабиторий_ВидыДоменныхСобытий;

	Уведомляемые = Новый Массив;
	Уведомляемые.Добавить(Виды.ЗаявкаПодана);
	Уведомляемые.Добавить(Виды.ЗаявкаАкцептована);
	Уведомляемые.Добавить(Виды.ЗаявкаОплачена);
	Уведомляемые.Добавить(Виды.РезультатСформирован);
	Уведомляемые.Добавить(Виды.РезультатВыдан);
	Уведомляемые.Добавить(Виды.ЗаявкаЗакрыта);

	Возврат Уведомляемые.Найти(ВидСобытия) <> Неопределено;

КонецФункции

#КонецОбласти
